Term4/teorver/practice/5.tex
% Created 2021-03-09 Tue 12:59
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Практика 5}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Практика 5},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{task}
Брак при изготовлении детали состовляет 20\%. Найти веротяность того что из 10 деталей не менее 3х годные.
\end{task}
\begin{solution}
\[ n = 10;\ p = 0.8;\ q = 0.2;\ 3 \le k \le 10 \]
\[ P_{10}(3 \le j \le 10) = 1 - P_{10}(k < 3) = 1 - (P_{10}(0) + P_{10}(1) + P_{10}(2)) \approx 1 - (q^{10} + C^1_{10}\cdot p^1\cdot q^9 + C^2_{10}\cdot p^2\cdot q^8) = \]
\[ = 1 - (0.2^8 + 10\cdot0.8\cdot0.2^9 + 45\cdot0.8^2\cdot0.2^8) \approx 0.999 \]
\end{solution}
\begin{task}
Найти вероятность того что при 180 бросаниях кости шестерка выпала 27 раз
\end{task}
\begin{solution}
\[ P_{180}(27) = C^{27}_{180} p^{27} q^{180 - 27} = C^{27}_{180} \left(\frac{1}{6}\right)^{27}\cdot\left(\frac{5}{6}\right)^{180 - 27} \approx 0.069 \]
\[ P_{180}(27) = \frac{1}{\sqrt{180 \cdot \frac{1}{6}\cdot\frac{5}{6}}} \cdot \varphi\left(\frac{27 - 180\cdot \frac{1}{6}}{\sqrt{180\cdot\frac{1}{6}\cdot\frac{5}{6}}}\right) \approx 0.0666\]
\end{solution}
\begin{task}
Брак составляет 20\%. Найти вероятность того, что из 900
деталей бракованных будет от 170 до 200
\end{task}
\begin{solution}
\[ x_1 = \frac{170 - 900\cdot0.2}{\sqrt{900\cdot0.2\cdot0.8}} \approx -0.83 \]
\[ x_2 = \frac{200 - 900\cdot0.2}{\sqrt{900\cdot0.2\cdot0.8}} \approx 1.67 \]
\[ P_{900}{170 \le k \le 200} \approx \Phi(x_1) - \Phi(x_2) \approx 0.4515 + 0.2967 = 0.7482\]
\end{solution}
\section{Формула Пуассона(формула редких событий)}
\label{sec:org8007e3b}
Применяем при \(p < \frac{1}{10}\) или \(n \ge 100\)
\[ P_n(k) \approx \frac{\lambda^k}{k!}e^{-\lambda} \], где \(\lambda = np\)
\begin{examp}
Вероятность звонка в службу поддержки --- 0.2.  Найти вероятность
того, что из 100 человек в службу поддержки позвонили от 1 до 3
человек.
\[ n= 100;\ p = 0.02;\ \lambda = np = 100\cdot0.02 = 2;\ 1 \le x \le 3 \]
\[ P_{100}(1 \le k \le 3) = P_{100}(1) + P_{100}(2) + P_{100}(3) = \frac{2^1}{1!}e^{-2} + \frac{2^2}{2!}e^{-2} + \frac{2^3}{3!}e^{-2} = (2 + 2 + \frac{4}{3})e^{-2} \approx 0.7218 \]
\end{examp}
\begin{task}
Вероятность клика по банеру на одной странице --- 0.005. Найти
вероятность того что на 1000 страниц будет 7 кликов по банеру
\end{task}
\begin{solution}
\[ n = 1000;\ p = 0.005;\ k = 7;\ \lambda = np = 1000\cdot 0.005 = 5 \]
\[ P_{1000}(7) \approx \frac{5^7}{7!}e^{-5} \approx 0.1044 \]
\end{solution}
\begin{task}
Прибор состоит из 100 элементов. Вероятность отказа каждого элемента
--- \(\frac{1}{100}\). Найти вероятность отказа больше 2 элемнтов
\end{task}
\begin{solution}
\[ n = 100;\ p = 0.01;\ \lambda = np = 100\cdot0.01 = 1 \]
\[ P_{100}(k > 2) = 1 - P_{100}(k \le 2) = 1 - (P_{100}(0) + P_{100}(1) + P_{100}(2)) = \]
\[ = 1 - (q^{100} + C^1_{100}\cdot p \cdot q^{99} + C^2_{100}\cdot p^2 \cdot q^{98}) \approx 0.07937 \]
\[ = 1 - \left(\frac{1^0}{0!} + \frac{1^1}{1!} + \frac{1^2}{2!}\right)\cdot e^{-1} \approx 0.0803 \]
\end{solution}
\section{ДЗ}
\label{sec:orgf151f57}
\begin{task}
Вероятность потери посылки на почте --- 0.1. Найти веротяность того
что из 10 посылок будут потеряны не болле 2х.
\end{task}
\begin{task}
Вероятность попадания стрелка в цель --- 0.7. Найти веротяность того,
что из 1000 выстрелов точными будут 710.
\end{task}
\begin{task}
Найти вероятность того что при 10000 бросаниях монеты герб выпадет от 4980 до 5020 раз.
\end{task}
\begin{task}
Вероятность опечатки на одной странице --- 0.025. Найти вероятность
того что в книге из 1000 страниц будет 3 опечатки.
\end{task}
\end{document}
